app/controllers/stats_controller.rb

SELECT * FROM "terms" WHERE ("terms"."id" = 1)
SELECT * FROM "stats" WHERE ("stats".term_id = 1) ORDER BY day ASC
---
  def show

    @term = Term.find(params[:id])
    @stats = @term.stats.find(:all, :order => "day ASC")