app/controllers/terms_controller.rb

  def index
    @terms = Term.all
---
SELECT * FROM "terms"

  def show
    @term = Term.find(params[:id])
    @stats = @term.stats.find(:all, :order => "day ASC")
---
SELECT * FROM "terms" WHERE ("terms"."id" = 1)
SELECT * FROM "stats" WHERE ("stats".term_id = 1) ORDER BY day ASC

  def create
    @term = Term.new(params[:term])
    if @term.save
---
INSERT INTO "terms" ("name", "created_at", "updated_at") VALUES('vaccin', '2010-01-17 18:33:54', '2010-01-17 18:33:54')